{
  "projects": [
    {
      "id": 1,
      "title": "Home Lab Kubernetes Cluster",
      "shortDescription": "Enterprise-grade Kubernetes infrastructure with 9 HP Spectre SFF PC nodes, Calico CNI, and GitLab CI/CD.",
      "fullDescription": "• Architected an enterprise-grade Kubernetes infrastructure comprising 9 HP Spectre SFF PC nodes running Ubuntu 20.04 LTS, implementing network segmentation using Calico CNI.\n• Engineered robust high-availability configurations with a distributed control plane, load balancing, and resource scheduling algorithms to optimize workload distribution and ensure system reliability.\n• Implemented infrastructure-as-code principles using Hashicorp Packer and a GitLab CI/CD pipeline for zero-downtime deployments.\n• Designed and implemented networking solutions, including a service mesh with Istio, for advanced traffic management and security.\n• Established monitoring and observability infrastructure utilizing Prometheus and Grafana, creating dashboards and alerting systems.\n• Leveraged Lens as a centralized management interface, integrating custom resource definitions and operators.",
      "technologies": ["Ubuntu", "Kubernetes", "Calico", "GitLab CI/CD", "Packer", "Lens", "Istio", "Prometheus", "Grafana"],
      "githubLink": "https://github.com/tanujp99",
      "showGithubLink": true,
      "imageLight": "project-hls-light.png",
      "imageDark": "project-hls-dark.png",
      "imageAlt": "Home Lab Server",
      "imageBgLight": "#f8f8f5",
      "imageBgDark": "#161719"
    },
    {
      "id": 2,
      "title": "Credit Card Fraud Detection",
      "shortDescription": "Architected and benchmarked ML models for fraud detection, improving precision and reducing false positives.",
      "fullDescription": "• Architected and benchmarked efficacy of four machine learning models to detect anomalies evaluating their performance across six metrics.\n• Engineered an innovative feature selection methodology that achieved breakthrough performance with a 23% precision improvement and approximately 30% reduction in false positives compared to industry-standard systems, enabling mission-critical real-time transaction analysis for financial institutions.\n• Pioneered novel approaches to imbalanced dataset handling, implementing advanced sampling techniques and custom loss functions that dramatically improved model robustness when detecting rare fraudulent transactions within massive legitimate transaction volumes.\n• Published as first author in prestigious international journal: Study of Machine Learning Algorithms for Credit Card Fraud Detection (IRJMETS Vol 4. 2022), contributing significant advancements to the field of financial security and algorithmic fraud detection.",
      "technologies": ["Regression", "Random Forest", "Support Vector Machine", "Machine Learning", "Python"],
      "githubLink": "https://github.com/tanujp99",
      "isResearch": true,
      "paperLink": "https://www.irjmets.com/uploadedfiles/paper//issue_4_april_2022/21641/final/fin_irjmets1653463905.pdf",
      "showGithubLink": true
    },
    {
      "id": 3,
      "title": "Advanced Stock Price Prediction System",
      "shortDescription": "Developed a stock price prediction system using time series regression, deep learning (LSTM), and Streamlit.",
      "fullDescription": "• Developed a stock price prediction system using time series regression and deep learning.\n• Engineered a real-time application with Streamlit for visualizations and forecasts.\n• Implemented FBProphet for time series forecasting.\n• Designed and implemented an LSTM network for enhanced prediction accuracy.",
      "technologies": ["Python", "FBProphet", "LSTM", "Streamlit"],
      "githubLink": "https://github.com/tanujp99",
      "imageLight": "project-spp-light.png",
      "imageDark": "project-spp-dark.png",
      "imageAlt": "Stock Price Prediction",
      "imageBgLight": "#fffffa",
      "imageBgDark": "#091117"
    },
    {
      "id": 4,
      "title": "Smart Solid Waste Management and Composting System",
      "shortDescription": "Engineered an Arduino-based IoT prototype for automated organic waste composting.",
      "fullDescription": "• Engineered an Arduino-based waste management prototype with ESP32 microcontrollers.\n• Developed environmental control algorithms using sensor feeds.\n• Designed custom circuit architecture and power management systems.\n• Implemented data collection and analysis capabilities for system refinement.",
      "technologies": ["IoT", "Arduino", "Hardware-based", "ESP32"],
      "githubLink": "https://github.com/tanujp99",
      "imageLight": "project-swm-light.png",
      "imageDark": "project-swm-dark.png",
      "imageAlt": "Smart Solid Waste Management",
      "imageBgLight": "#f8f8f5",
      "imageBgDark": "#0c131a"
    }
  ]
}
